docs/loadtest-results/2026-07-27T10-00-40-642Z/k6-shard-3.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 98 max VUs, 50s max duration (incl. graceful stop):
              * debounce_spread: 80.00 iterations/s for 20s (maxVUs: 26-98, gracefulStop: 30s)


running (01.0s), 01/26 VUs, 77 complete and 0 interrupted iterations
debounce_spread   [   5% ] 01/26 VUs  01.0s/20s  80.00 iters/s

running (02.0s), 01/26 VUs, 157 complete and 0 interrupted iterations
debounce_spread   [  10% ] 01/26 VUs  02.0s/20s  80.00 iters/s

running (03.0s), 00/26 VUs, 238 complete and 0 interrupted iterations
debounce_spread   [  15% ] 00/26 VUs  03.0s/20s  80.00 iters/s

running (04.0s), 00/26 VUs, 318 complete and 0 interrupted iterations
debounce_spread   [  20% ] 00/26 VUs  04.0s/20s  80.00 iters/s

running (05.0s), 00/26 VUs, 398 complete and 0 interrupted iterations
debounce_spread   [  25% ] 00/26 VUs  05.0s/20s  80.00 iters/s

running (06.0s), 00/26 VUs, 478 complete and 0 interrupted iterations
debounce_spread   [  30% ] 00/26 VUs  06.0s/20s  80.00 iters/s

running (07.0s), 00/26 VUs, 558 complete and 0 interrupted iterations
debounce_spread   [  35% ] 00/26 VUs  07.0s/20s  80.00 iters/s

running (08.0s), 00/26 VUs, 638 complete and 0 interrupted iterations
debounce_spread   [  40% ] 00/26 VUs  08.0s/20s  80.00 iters/s

running (09.0s), 00/26 VUs, 718 complete and 0 interrupted iterations
debounce_spread   [  45% ] 00/26 VUs  09.0s/20s  80.00 iters/s

running (10.0s), 00/26 VUs, 798 complete and 0 interrupted iterations
debounce_spread   [  50% ] 00/26 VUs  10.0s/20s  80.00 iters/s

running (11.0s), 00/26 VUs, 878 complete and 0 interrupted iterations
debounce_spread   [  55% ] 00/26 VUs  11.0s/20s  80.00 iters/s

running (12.0s), 00/26 VUs, 958 complete and 0 interrupted iterations
debounce_spread   [  60% ] 00/26 VUs  12.0s/20s  80.00 iters/s

running (13.0s), 01/26 VUs, 1037 complete and 0 interrupted iterations
debounce_spread   [  65% ] 01/26 VUs  13.0s/20s  80.00 iters/s

running (14.0s), 00/26 VUs, 1118 complete and 0 interrupted iterations
debounce_spread   [  70% ] 00/26 VUs  14.0s/20s  80.00 iters/s

running (15.0s), 00/26 VUs, 1198 complete and 0 interrupted iterations
debounce_spread   [  75% ] 00/26 VUs  15.0s/20s  80.00 iters/s

running (16.0s), 00/26 VUs, 1278 complete and 0 interrupted iterations
debounce_spread   [  80% ] 00/26 VUs  16.0s/20s  80.00 iters/s

running (17.0s), 01/26 VUs, 1357 complete and 0 interrupted iterations
debounce_spread   [  85% ] 01/26 VUs  17.0s/20s  80.00 iters/s

running (18.0s), 00/26 VUs, 1438 complete and 0 interrupted iterations
debounce_spread   [  90% ] 00/26 VUs  18.0s/20s  80.00 iters/s

running (19.0s), 00/26 VUs, 1518 complete and 0 interrupted iterations
debounce_spread   [  95% ] 00/26 VUs  19.0s/20s  80.00 iters/s

running (20.0s), 00/26 VUs, 1598 complete and 0 interrupted iterations
debounce_spread   [ 100% ] 00/26 VUs  20.0s/20s  80.00 iters/s


  █ TOTAL RESULTS 

    CUSTOM
    signals_accepted_202...........: 449    22.451313/s
    signals_rate_limited_429.......: 1152   57.603368/s
    signals_sampled_sent...........: 36     1.800105/s

    HTTP
    http_req_duration..............: avg=8.04ms min=1.08ms med=3.67ms max=437.64ms p(50)=3.67ms p(95)=16.96ms p(99)=50.44ms
      { expected_response:true }...: avg=8.04ms min=1.08ms med=3.67ms max=437.64ms p(50)=3.67ms p(95)=16.96ms p(99)=50.44ms
    http_req_failed................: 0.00%  0 out of 1601
    http_reqs......................: 1601   80.054681/s

    EXECUTION
    iteration_duration.............: avg=8.42ms min=1.27ms med=4.03ms max=439.39ms p(50)=4.03ms p(95)=17.37ms p(99)=50.71ms
    iterations.....................: 1601   80.054681/s
    vus............................: 1      min=1         max=2 
    vus_max........................: 26     min=26        max=26

    NETWORK
    data_received..................: 1.8 MB 89 kB/s
    data_sent......................: 771 kB 39 kB/s



running (20.0s), 00/26 VUs, 1601 complete and 0 interrupted iterations
debounce_spread ✓ [ 100% ] 00/26 VUs  20s  80.00 iters/s